<a href="https://colab.research.google.com/github/salehafzoon/Data-Science/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Show installed versions

> update to last version

> pandas version

> all dependencies versions

In [ ]:
!pip install --upgrade pandas

In [ ]:
import pandas as pd
import numpy as np
pd.__version__

'1.1.5'

In [ ]:
pd.show_versions()

# Create

> from CSV

> from Dictionary

>randomly

In [ ]:

print("pandas version:",pd.__version__)

url = "https://www.stats.govt.nz/assets/Uploads/Tools/CSV-files-for-download/analysis-public-place-assaults-sexual-assaults-and-robberies-2015-csv.csv"
df = pd.read_csv(url)

In [ ]:
tempdict = {'col1':[1,2,3], 'col2':[4,5,6]}
df2 = pd.DataFrame.from_dict(tempdict)
df2

In [ ]:
df3=pd.DataFrame(np.random.rand(4,8), columns = list('abCDEFGH'))
df3

          a         b         C  ...         F         G         H
0  0.475099  0.264292  0.037506  ...  0.929411  0.445329  0.111164
1  0.603878  0.278447  0.569788  ...  0.592064  0.680034  0.582279
2  0.512776  0.657998  0.016967  ...  0.038533  0.068783  0.806877
3  0.799110  0.557030  0.005385  ...  0.408375  0.478540  0.368358

[4 rows x 8 columns]

# Rename

In [ ]:
df3.rename({'a':'A','b':'B'} , axis = 'columns')

          A         B         C  ...         F         G         H
0  0.475099  0.264292  0.037506  ...  0.929411  0.445329  0.111164
1  0.603878  0.278447  0.569788  ...  0.592064  0.680034  0.582279
2  0.512776  0.657998  0.016967  ...  0.038533  0.068783  0.806877
3  0.799110  0.557030  0.005385  ...  0.408375  0.478540  0.368358

[4 rows x 8 columns]

In [ ]:
df3.columns = ['v1','v2','v3','v4','v5','v6','v7','v8']

df3.columns = df3.columns.str.replace('v','')

df3 = df3.add_prefix('col_')
df3 = df3.add_suffix('_x')
df3

    col_1_x   col_2_x   col_3_x  ...   col_6_x   col_7_x   col_8_x
0  0.475099  0.264292  0.037506  ...  0.929411  0.445329  0.111164
1  0.603878  0.278447  0.569788  ...  0.592064  0.680034  0.582279
2  0.512776  0.657998  0.016967  ...  0.038533  0.068783  0.806877
3  0.799110  0.557030  0.005385  ...  0.408375  0.478540  0.368358

[4 rows x 8 columns]


# Reverse order


> row order

> column order

In [ ]:
drinks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/drinks.csv')

In [ ]:
drinks.loc[::-1].reset_index(drop=True).head()

     country  beer_servings  ...  total_litres_of_pure_alcohol      continent
0   Zimbabwe             64  ...                           4.7         Africa
1     Zambia             32  ...                           2.5         Africa
2      Yemen              6  ...                           0.1           Asia
3    Vietnam            111  ...                           2.0           Asia
4  Venezuela            333  ...                           7.7  South America

[5 rows x 6 columns]

In [ ]:
drinks.loc[:,::-1].head()

  continent  total_litres_of_pure_alcohol  ...  beer_servings      country
0      Asia                           0.0  ...              0  Afghanistan
1    Europe                           4.9  ...             89      Albania
2    Africa                           0.7  ...             25      Algeria
3    Europe                          12.4  ...            245      Andorra
4    Africa                           5.9  ...            217       Angola

[5 rows x 6 columns]

# Select by data type

In [ ]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [ ]:
drinks.select_dtypes(include=['number','object']).head()

In [ ]:
drinks.select_dtypes(exclude='object').head()

# Convert string to number

In [ ]:
df = pd.DataFrame({'col_one':['1.1','1.2','1.3',],
                   'col_two':['2.1','2.2','2.3',],'col_three':['3.1','3.2','-',]})
df

In [ ]:
df.astype({'col_one':'float','col_two':'float'}).dtypes

In [ ]:
pd.to_numeric(df.col_three, errors = 'coerce')

In [ ]:
df = df.apply(pd.to_numeric, errors = 'coerce').fillna(0)
df

# Reduce DataFrame size

In [ ]:
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [ ]:
cols = ['beer_servings','continent']
dtypes = {'continent':'category'}
small_drinks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/drinks.csv',
                           usecols=cols, dtype = dtypes)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB


# Build a DataFrame from multiple files(row-wise)

In [ ]:
from glob import glob

stock_files = sorted(glob('data/stocks*.csv'))
stock_files

['data/stocks.csv', 'data/stocks1.csv', 'data/stocks2.csv', 'data/stocks3.csv']

In [ ]:
pd.concat((pd.read_csv(file) for file in stock_files) , ignore_index= True )


# Build a DataFrame from multiple files(column-wise)

In [ ]:
drink_files = sorted(glob('data/drinks*.csv'))
drink_files

['data/drinks.csv', 'data/drinks1.csv', 'data/drinks2.csv']

In [ ]:
pd.concat((pd.read_csv(file) for file in drink_files), axis = 'columns' ).head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 12 columns]

# Split a DataFrame into two random subsets

In [ ]:
movies = pd.read_csv('data/imdb_1000.csv')
len(movies)

979

In [ ]:
# just works fot data with unique index
movie1 = movies.sample(frac = 0.75,random_state = 12345)
movie2 = movies.drop(movie1.index)
len(movie1) + len(movie2)

979

In [ ]:
movie1.index.sort_values()

Int64Index([  0,   2,   3,   4,   6,   7,   8,   9,  10,  11,
            ...
            969, 970, 971, 972, 973, 974, 975, 976, 977, 978],
           dtype='int64', length=734)

In [ ]:
movie2.index.sort_values()

Int64Index([  1,   5,  15,  23,  26,  29,  32,  34,  36,  37,
            ...
            913, 914, 915, 916, 918, 919, 921, 926, 929, 941],
           dtype='int64', length=245)

# Filter a DataFrame by multiple categories

In [ ]:
movies.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [ ]:
movies[movies.genre.isin(['Crime', 'Action', 'Drama'])].head()

# or not

movies[~movies.genre.isin(['Crime', 'Action', 'Drama'])].head()

    star_rating  ...                                        actors_list
6           8.9  ...  [u'Clint Eastwood', u'Eli Wallach', u'Lee Van ...
7           8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
8           8.9  ...  [u'Liam Neeson', u'Ralph Fiennes', u'Ben Kings...
10          8.8  ...  [u'Elijah Wood', u'Ian McKellen', u'Orlando Bl...
14          8.8  ...  [u'Elijah Wood', u'Ian McKellen', u'Viggo Mort...

[5 rows x 6 columns]

# Filter a DataFrame by largest categories

In [ ]:
count = movies.genre.value_counts()
count

Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Adventure     75
Animation     62
Horror        29
Mystery       16
Western        9
Thriller       5
Sci-Fi         5
Film-Noir      3
Family         2
History        1
Fantasy        1
Name: genre, dtype: int64

In [ ]:
count.nlargest(3)

Drama     278
Comedy    156
Action    136
Name: genre, dtype: int64

In [ ]:
count.nlargest(3).index

Index(['Drama', 'Comedy', 'Action'], dtype='object')

In [ ]:
movies[movies.genre.isin(count.nlargest(3).index)].head()

# Handle missing values

In [ ]:
ufo = pd.read_csv('data/ufo.csv')

# number of nulls per each column
ufo.isna().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [ ]:
ufo.isna().mean()

City               0.001371
Colors Reported    0.842004
Shape Reported     0.144948
State              0.000000
Time               0.000000
dtype: float64

In [ ]:
ufo.dropna(axis='columns').head()

  State             Time
0    NY   6/1/1930 22:00
1    NJ  6/30/1930 20:00
2    CO  2/15/1931 14:00
3    KS   6/1/1931 13:00
4    NY  4/18/1933 19:00

In [ ]:
# droping only rows with >='10%' of values

# number of rows = len(ufo)

ufo.dropna(thresh= 0.9 * len(ufo), axis='columns').head()

                   City State             Time
0                Ithaca    NY   6/1/1930 22:00
1           Willingboro    NJ  6/30/1930 20:00
2               Holyoke    CO  2/15/1931 14:00
3               Abilene    KS   6/1/1931 13:00
4  New York Worlds Fair    NY  4/18/1933 19:00

# Split a string into multiple columns

In [ ]:
df = pd.DataFrame({'name':['John Arthur Doe','Jane Ann Smith'],
                   'location':['Los Angeles , CA','Washington, DC']})
df

              name          location
0  John Arthur Doe  Los Angeles , CA
1   Jane Ann Smith    Washington, DC

In [ ]:
df.name.str.split(' ', expand=True)

      0       1      2
0  John  Arthur    Doe
1  Jane     Ann  Smith

In [ ]:
df[['first','mid','last']]= df.name.str.split(' ', expand=True)
df

              name          location first     mid   last
0  John Arthur Doe  Los Angeles , CA  John  Arthur    Doe
1   Jane Ann Smith    Washington, DC  Jane     Ann  Smith

In [ ]:
df['city']= df.location.str.split(',', expand=True)[0]
df

              name          location first     mid   last          city
0  John Arthur Doe  Los Angeles , CA  John  Arthur    Doe  Los Angeles
1   Jane Ann Smith    Washington, DC  Jane     Ann  Smith    Washington

# Expand a Series of list into a DataFrame

In [ ]:
df = pd.DataFrame({'col_one':['a','b','c'], 'col_two':[[10,40],[20,50],[30,60],]})
df

  col_one   col_two
0       a  [10, 40]
1       b  [20, 50]
2       c  [30, 60]

In [ ]:
df_new = df.col_two.apply(pd.Series)
df_new

    0   1
0  10  40
1  20  50
2  30  60

In [ ]:
pd.concat([df,df_new] , axis='columns')

  col_one   col_two   0   1
0       a  [10, 40]  10  40
1       b  [20, 50]  20  50
2       c  [30, 60]  30  60

# Aggregate by multiple functions

In [8]:
orders = pd.read_csv('data/chipotle.tsv',sep='\t')
orders.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [11]:
orders.groupby('order_id').item_price.sum().head()

# and for multiple aggregate functions

orders.groupby('order_id').item_price.agg(['sum','count']).head()

                               sum  count
order_id
1         $2.39 $3.39 $3.39 $2.39       4
2                          $16.98       1
3                    $10.98 $1.69       2
4                    $11.75 $9.25       2
5                     $9.25 $4.45       2

# Combine aggergation output with a DataFrame

Output of aggregate function is smaller than input
so we can use transform function

In [14]:
orders['tota_price'] = orders.groupby('order_id').item_price.transform('sum')
orders.head()

   order_id  quantity  ... item_price                tota_price
0         1         1  ...     $2.39   $2.39 $3.39 $3.39 $2.39
1         1         1  ...     $3.39   $2.39 $3.39 $3.39 $2.39
2         1         1  ...     $3.39   $2.39 $3.39 $3.39 $2.39
3         1         1  ...     $2.39   $2.39 $3.39 $3.39 $2.39
4         2         2  ...    $16.98                    $16.98

[5 rows x 6 columns]

# Select a slice of rows and columns

In [ ]:
titanic = pd.read_csv('data/titanic_train.csv')
titanic.head()

In [16]:
titanic.describe().loc['min':'max','Pclass':'Parch']

     Pclass     Age  SibSp  Parch
min     1.0   0.420    0.0    0.0
25%     2.0  20.125    0.0    0.0
50%     3.0  28.000    0.0    0.0
75%     3.0  38.000    1.0    0.0
max     3.0  80.000    8.0    6.0

# Reshape a MultiIndexed Series

- Multi indexed series could be resulted from groupby multi columns

- for creating better view we could use unstack method

In [20]:
titanic.groupby('Sex').Survived.mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [21]:
titanic.groupby(['Sex','Pclass']).Survived.mean().unstack()

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# Create a pivot table

In [22]:
titanic.pivot_table(index = 'Sex' , columns='Pclass' , values='Survived', aggfunc='mean')

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [23]:
titanic.pivot_table(index = 'Sex' , columns='Pclass' , values='Survived', aggfunc='mean',
                    margins = True)

Pclass         1         2         3       All
Sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [24]:
titanic.pivot_table(index = 'Sex' , columns='Pclass' , values='Survived', 
                    aggfunc='count',margins = True)

Pclass    1    2    3  All
Sex
female   94   76  144  314
male    122  108  347  577
All     216  184  491  891

# Convert continuous data into categorical data

In [25]:
titanic.Age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [28]:
pd.cut(titanic.Age, bins=[0,18,25,99], labels = ['child','young adult', 'adult']).head(10)

0    young adult
1          adult
2          adult
3          adult
4          adult
5            NaN
6          adult
7          child
8          adult
9          child
Name: Age, dtype: category
Categories (3, object): ['child' < 'young adult' < 'adult']

# Change display options

In [35]:
titanic[['Age','Fare']].head()

    Age  Fare
0 22.00  7.25
1 38.00 71.28
2 26.00  7.92
3 35.00 53.10
4 35.00  8.05

In [38]:
pd.set_option('display.float_format','{:.2f}'.format)
titanic[['Age','Fare']].head()

    Age  Fare
0 22.00  7.25
1 38.00 71.28
2 26.00  7.92
3 35.00 53.10
4 35.00  8.05

In [37]:
pd.reset_option('display.float_format')

# Style a DataFrame

In [39]:
stocks = pd.read_csv('data/stocks.csv')
stocks.head()

         Date  Close    Volume Symbol
0  2016-10-03  31.50  14070500   CSCO
1  2016-10-03 112.52  21701800   AAPL
2  2016-10-03  57.42  19189500   MSFT
3  2016-10-04 113.00  29736800   AAPL
4  2016-10-04  57.24  20085900   MSFT

In [54]:
# format_dict = {'Date': '{: %m/%d/%y}','Close':'${:.2f}','Volume':'{:,}'}
format_dict = {'Close':'${:.2f}','Volume':'{:,}'}

stocks.style.format(format_dict)

In [58]:
(stocks.style.format(format_dict).hide_index()
.highlight_min('Close', color = 'red')
.highlight_max('Close', color = 'lightgreen')
)

In [62]:
(stocks.style.format(format_dict).hide_index()
.background_gradient(subset = 'Volume' , cmap = 'Blues')
)

In [63]:
(stocks.style.format(format_dict).hide_index()
.bar('Volume' ,color = 'lightblue' ,align = 'zero')
.set_caption('Stock Price from October 2016')
)

# Profile a DataFrame

In [ ]:
!pip install pandas_profiling --upgrade

In [72]:

from pandas_profiling import ProfileReport
ProfileReport(stocks)

OSError: ignored

# Read

> show top,bottom 3 rows


> show columns , data types

In [ ]:
df.head(3)

   Index  Area_unit_2013_code  ... Region_2013_code  Region_2013_label
0      1               514102  ...                2    Auckland Region
1      2               573101  ...                9  Wellington Region
2      3               529700  ...                3     Waikato Region

[3 rows x 14 columns]

In [ ]:
df.tail(3)

      Index  Area_unit_2013_code  ... Region_2013_code     Region_2013_label
2017   2018               536513  ...                4  Bay of Plenty Region
2018   2019               574302  ...                9     Wellington Region
2019   2020               527007  ...                3        Waikato Region

[3 rows x 14 columns]

In [ ]:
df.columns

Index(['Index', 'Area_unit_2013_code', 'Area_unit_2013_label',
       'Victimisations_calendar_year_2015', 'Population_mid_point_2015',
       ' Rate_per_10000_population ', ' Rate_ratio_NZ_average_rate ',
       'Urban_area_2013_code', 'Urban_area_2013_label', 'Urban_area_type',
       'Territorial_authority_area_2013_code',
       'Territorial_authority_area_2013_label', 'Region_2013_code',
       'Region_2013_label'],
      dtype='object')

In [ ]:
df.dtypes

Index                                     int64
Area_unit_2013_code                       int64
Area_unit_2013_label                     object
Victimisations_calendar_year_2015         int64
Population_mid_point_2015                 int64
 Rate_per_10000_population               object
 Rate_ratio_NZ_average_rate              object
Urban_area_2013_code                      int64
Urban_area_2013_label                    object
Urban_area_type                          object
Territorial_authority_area_2013_code      int64
Territorial_authority_area_2013_label    object
Region_2013_code                          int64
Region_2013_label                        object
dtype: object

# Summary Statistics

In [ ]:
df.describe()

             Index  ...  Region_2013_code
count  2020.000000  ...       2020.000000
mean   1010.500000  ...          8.205941
std     583.268092  ...         10.171251
min       1.000000  ...          1.000000
25%     505.750000  ...          2.000000
50%    1010.500000  ...          7.000000
75%    1515.250000  ...         13.000000
max    2020.000000  ...         99.000000

[8 rows x 7 columns]

In [ ]:
df.describe(include ="object")

       Area_unit_2013_label  ... Region_2013_label
count                  2020  ...              2020
unique                 2020  ...                17
top             Bare Island  ...   Auckland Region
freq                      1  ...               437

[4 rows x 7 columns]

# Filtering Columns


> column base


> row base

In [ ]:
df= df[(df['Area_unit_2013_code']!="null")]

df[['Area_unit_2013_code','Population_mid_point_2015']]

      Area_unit_2013_code  Population_mid_point_2015
0                  514102                      15900
1                  573101                       8300
2                  529700                       3170
3                  514103                      13250
4                  591500                        570
...                   ...                        ...
2015               506653                       3510
2016               610601                       3590
2017               536513                       3590
2018               574302                       4020
2019               527007                       5440

[2020 rows x 2 columns]

In [ ]:
df.Area_unit_2013_code.unique()

array([514102, 573101, 529700, ..., 536513, 574302, 527007])

In [ ]:
victs = df.Victimisations_calendar_year_2015
popMid = df.Population_mid_point_2015

df[(victs >= victs.mean()) &(popMid < popMid.mean())].shape

(111, 14)

# iloc indexing

In [ ]:
# row 5
df.iloc[4]

# row 5 column 1
df.iloc[4,0]

# rows from 5 to 10
df.iloc[4:11]

    Index  Area_unit_2013_code  ... Region_2013_code         Region_2013_label
4       5               591500  ...               13         Canterbury Region
5       6               514101  ...                2           Auckland Region
6       7               524604  ...                2           Auckland Region
7       8               562800  ...                8  Manawatu-Wanganui Region
8       9               540410  ...                4      Bay of Plenty Region
9      10               538201  ...                4      Bay of Plenty Region
10     11               603100  ...               14              Otago Region

[7 rows x 14 columns]

# loc indexing

In [ ]:
dfCopy = df.copy()
dfCopy.set_index('Area_unit_2013_label',inplace = True)
dfCopy.head()

                                 Index  ...  Region_2013_label
Area_unit_2013_label                    ...
Auckland Central West                1  ...    Auckland Region
Willis Street-Cambridge Terrace      2  ...  Wellington Region
Hamilton Central                     3  ...     Waikato Region
Auckland Central East                4  ...    Auckland Region
Cathedral Square                     5  ...  Canterbury Region

[5 rows x 13 columns]

# Update


> drop rows
> add new column
> condition based updating using apply

In [ ]:
# drop rows with null value
df.dropna(inplace= True)
df.isnull().sum()

Index                                    0
Area_unit_2013_code                      0
Area_unit_2013_label                     0
Victimisations_calendar_year_2015        0
Population_mid_point_2015                0
 Rate_per_10000_population               0
 Rate_ratio_NZ_average_rate              0
Urban_area_2013_code                     0
Urban_area_2013_label                    0
Urban_area_type                          0
Territorial_authority_area_2013_code     0
Territorial_authority_area_2013_label    0
Region_2013_code                         0
Region_2013_label                        0
dtype: int64

In [ ]:
dfCopy.drop('Urban_area_type',axis = 1)

                                 Index  ...     Region_2013_label
Area_unit_2013_label                    ...
Auckland Central West                1  ...       Auckland Region
Willis Street-Cambridge Terrace      2  ...     Wellington Region
Hamilton Central                     3  ...        Waikato Region
Auckland Central East                4  ...       Auckland Region
Cathedral Square                     5  ...     Canterbury Region
...                                ...  ...                   ...
Riverhead                         2016  ...       Auckland Region
Grasmere                          2017  ...      Southland Region
Bethlehem East                    2018  ...  Bay of Plenty Region
Te Kainga                         2019  ...     Wellington Region
Horsham Downs                     2020  ...        Waikato Region

[2020 rows x 12 columns]

In [ ]:
df['New column'] = df.
df.head()

In [ ]:
df[] = df[].apply(lambda x: 1 if x else 0)

# Delete/Ouptut


> Output to csv

> Output to json

> Output to html

> Delete a data frame

In [ ]:
df.to_csv('output.csv')

df.to_json()

In [ ]:
df.to_html()

In [ ]:
del df